; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v1 ?v12)
             (pred_6 ?v8 ?v6)
             (pred_4 ?v1 ?v6)
             (pred_3 ?v2 ?v1 )
	     (pred_2 ?v1)
             (pred_11 ?v4)
             (pred_10 ?v8)
             (pred_1 ?v6)
             (pred_8 ?v1)
             (pred_5 ?v8)
             (pred_9 ?v1)
             (pred_12 ))



(:action op_4
:parameters (?v10 ?v13 ?v9 ?v3)
:precondition (and (pred_11 ?v10) (pred_11 ?v13) (pred_10 ?v9) (pred_1 ?v3)
          (pred_7 ?v10 ?v13) (pred_6 ?v9 ?v3)
                   (pred_4 ?v13 ?v3) (pred_2 ?v10) 
                   (pred_8 ?v13) (pred_5 ?v9))
:effect (and  (pred_9 ?v13) (not (pred_8 ?v13))))


(:action op_2
:parameters (?v10 ?v11)
:precondition (and (pred_11 ?v10) (pred_11 ?v11)
               (pred_2 ?v10) (pred_7 ?v10 ?v11) (pred_9 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v10))))

(:action op_1
:parameters (?v10 ?v9)
:precondition (and (pred_11 ?v10) (pred_10 ?v9) 
                  (pred_2 ?v10) (pred_3 ?v9 ?v10) (pred_12 ))
:effect (and (pred_5 ?v9)
   (not (pred_3 ?v9 ?v10)) (not (pred_12 ))))


(:action op_5
:parameters (?v10 ?v7 ?v5)
:precondition (and (pred_11 ?v10) (pred_10 ?v7) (pred_10 ?v5)
                  (pred_2 ?v10) (pred_5 ?v5) (pred_3 ?v7 ?v10))
:effect (and (pred_5 ?v7) (pred_3 ?v5 ?v10)
        (not (pred_5 ?v5)) (not (pred_3 ?v7 ?v10))))

(:action op_3
:parameters (?v10 ?v9)
:precondition (and (pred_11 ?v10) (pred_10 ?v9) 
                  (pred_2 ?v10) (pred_5 ?v9))
:effect (and (pred_12 ) (pred_3 ?v9 ?v10) (not (pred_5 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_07 obj_02 obj_17 obj_21 obj_04 obj_20 obj_10 obj_06 obj_03 obj_14 obj_08 obj_18 obj_19 obj_11 obj_13
    obj_15 obj_01 obj_16
    obj_09 obj_22 obj_05
    )

    (:init
       (pred_12)

       (pred_11 obj_12)
       (pred_11 obj_07)
       (pred_11 obj_02)
       (pred_11 obj_17)
       (pred_11 obj_21)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_10)
       (pred_11 obj_06)
       (pred_11 obj_03)
       (pred_11 obj_14)
       (pred_11 obj_08)
       (pred_11 obj_18)
       (pred_11 obj_19)
       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_1 obj_15)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_10 obj_09)
       (pred_10 obj_22)
       (pred_10 obj_05)

       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_02 obj_20)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_20 obj_14)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_02)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_06 obj_18)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_06 obj_21)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_20)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_08 obj_13)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_18 obj_06)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_13 obj_08)
       (pred_7 obj_13 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_8 obj_12)
       (pred_4  obj_14 obj_15)
       (pred_4  obj_13 obj_01)
       (pred_4  obj_12 obj_16)
       (pred_9 obj_07)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_21)
       (pred_9 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_19)
       (pred_9 obj_11)

       (pred_6  obj_09 obj_15)
       (pred_6  obj_22 obj_01)
       (pred_6  obj_05 obj_16)
       (pred_3 obj_09 obj_06)
       (pred_3 obj_22 obj_02)
       (pred_3 obj_05 obj_21)
       (pred_2 obj_11)
    )

    (:goal (and
       (pred_3 obj_22 obj_21)
       (pred_3 obj_05 obj_08)
    ))
(:constraints
  (always (not (pred_2 obj_20)))
)
)

; plan
1. (op_2 obj_11 obj_19)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_19)
   goals met: 0 of 2
2. (op_2 obj_19 obj_03)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_03)
   goals met: 0 of 2
3. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 0 of 2
4. (op_2 obj_04 obj_21)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_21)
   goals met: 0 of 2
5. (op_1 obj_21 obj_05)
   deleted: (pred_3 obj_05 obj_21) (pred_12)
   added: (pred_5 obj_05)
   goals met: 0 of 2
6. (op_2 obj_21 obj_04)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_04)
   goals met: 0 of 2
7. (op_2 obj_04 obj_07)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_07)
   goals met: 0 of 2
8. (op_2 obj_07 obj_02)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_02)
   goals met: 0 of 2
9. (op_2 obj_02 obj_17)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_17)
   goals met: 0 of 2
10. (op_2 obj_17 obj_10)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_10)
   goals met: 0 of 2
11. (op_2 obj_10 obj_08)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_08)
   goals met: 0 of 2
12. (op_3 obj_08 obj_05)
   deleted: (pred_5 obj_05)
   added: (pred_12) (pred_3 obj_05 obj_08)
   goals met: 1 of 2
13. (op_2 obj_08 obj_10)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_10)
   goals met: 1 of 2
14. (op_2 obj_10 obj_17)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_17)
   goals met: 1 of 2
15. (op_2 obj_17 obj_02)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_02)
   goals met: 1 of 2
16. (op_1 obj_02 obj_22)
   deleted: (pred_3 obj_22 obj_02) (pred_12)
   added: (pred_5 obj_22)
   goals met: 1 of 2
17. (op_2 obj_02 obj_07)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_07)
   goals met: 1 of 2
18. (op_2 obj_07 obj_04)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_04)
   goals met: 1 of 2
19. (op_2 obj_04 obj_21)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_21)
   goals met: 1 of 2
20. (op_3 obj_21 obj_22)
   deleted: (pred_5 obj_22)
   added: (pred_12) (pred_3 obj_22 obj_21)
   goals met: 2 of 2
